Documents/ЗаявкаНаОткрытиеСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОткрытиеСчетов</Name>
			<Comment>(Упр)</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПодтверждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделениеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалОтделенияБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводНачальныхСведений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБанка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭмбоссированныйТекст1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭмбоссированныйТекст2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭмбоссированныйТекст3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЛицевогоСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Comment>vvv</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорБанка</Name>
							<Comment>vvv</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛицевыеСчетаРаботниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчетаРаботниковОрганизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЛицевогоСчетаIBAN</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЛицевогоСчетаСтарый</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОткрытиеСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорБанка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявкаНаОткрытиеСчетов/Ext/ObjectModule.bsl
//vvv
Перем мОрганизация, мБанк;
//
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//vvv
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Проведен Тогда
		ОбъектВБазе = Ссылка.ПолучитьОбъект();
		мОрганизация = ОбъектВБазе.Организация;
		мБанк = ОбъектВБазе.Банк;
		мДоговор = ОбъектВБазе.ДоговорБанка;
		ОбработкаУдаленияПроведения(Ложь);
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Банк", Банк);
		Запрос.УстановитьПараметр("ДоговорБанка", ДоговорБанка);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
		
		МассивСотрудников = Новый Массив;
		Если ВводНачальныхСведений Тогда
			МассивСотрудников = РаботникиОрганизации.ВыгрузитьКолонку("ФизЛицо");
		Иначе
			
			Попытка
				ИсходноеДерево = ЗначениеИзСтрокиВнутр(ТекстПодтверждения);
			Исключение
				Возврат;
			КонецПопытки;
			
			Если ТипЗнч(ИсходноеДерево) <> Тип("ДеревоЗначений") Тогда
				Возврат;
			КонецЕсли;
			
			МассивОпераций = ПроцедурыУправленияПерсоналом.ПолучитьОперацииПоЛицевымСчетамРаботников(ИсходноеДерево, "РезультатОткрытияСчетов");
			 			
			Для каждого ОперацияПодтверждения из МассивОпераций Цикл
				
				МассивСотрудников.Добавить(ОперацияПодтверждения.Сотрудник);
				
			КонецЦикла;
			
		КонецЕсли;
	    Запрос.УстановитьПараметр("Сотрудники", МассивСотрудников);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Представление(ЛицевыеСчетаРаботниковОрганизации.ФизЛицо) Как ФизЛицоНаименование
		               |ИЗ
		               |	РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
		               |ГДЕ
		               |	ЛицевыеСчетаРаботниковОрганизации.Организация = &Организация
		               |	И ЛицевыеСчетаРаботниковОрганизации.Банк = &Банк
					   |	И ЛицевыеСчетаРаботниковОрганизации.ДоговорБанка = &ДоговорБанка
		               |	И ЛицевыеСчетаРаботниковОрганизации.Документ <> &ДокументСсылка
		               |	И ЛицевыеСчетаРаботниковОрганизации.ФизЛицо В (&Сотрудники)";
					   
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() > 0 Тогда
			СтрокаСообщения = " На указанных сотрудников уже введены данные:";
			Пока Выборка.Следующий() Цикл
				СтрокаСообщения = СтрокаСообщения + Символы.ПС + "    " + Выборка.ФизЛицоНаименование;
				
			КонецЦикла;
			Сообщить(СтрокаСообщения);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	МассивТЧ = Новый Массив();
	МассивТЧ.Добавить(РаботникиОрганизации);
	//
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации, , "Физлицо");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//vvv комментируем, убрали в регистре сведений ЛицевыеСчетаРаботниковОрганизации подчинение регистратору
	//НаборЛицевыхСчетов = Движения.ЛицевыеСчетаРаботниковОрганизации;
	
	//vvv
	НаборЛицевыхСчетов = РегистрыСведений.ЛицевыеСчетаРаботниковОрганизации.СоздатьНаборЗаписей();
	НаборЛицевыхСчетов.Отбор.Организация.Установить(Организация);
	//НаборЛицевыхСчетов.Отбор.Банк.Установить(Банк);
	//НаборЛицевыхСчетов.Отбор.ДоговорБанка.Установить(ДоговорБанка);
	//
	
	Если ВводНачальныхСведений Тогда
		Для каждого СтрокаСРаботником Из РаботникиОрганизации Цикл			
			//vvv
			НаборЛицевыхСчетов.Отбор.Банк.Установить(?(ЗначениеЗаполнено(СтрокаСРаботником.Банк),СтрокаСРаботником.Банк,Банк));
			НаборЛицевыхСчетов.Отбор.ДоговорБанка.Установить(?(ЗначениеЗаполнено(СтрокаСРаботником.ДоговорБанка),СтрокаСРаботником.ДоговорБанка,ДоговорБанка));
			НаборЛицевыхСчетов.Отбор.ФизЛицо.Установить(СтрокаСРаботником.ФизЛицо);
			НаборЛицевыхСчетов.Прочитать();
			//
			ЗаписьЛицевогоСчета = НаборЛицевыхСчетов.Добавить();
			ЗаписьЛицевогоСчета.Организация = Организация;
			ЗаписьЛицевогоСчета.Банк = ?(ЗначениеЗаполнено(СтрокаСРаботником.Банк),СтрокаСРаботником.Банк,Банк);
			ЗаписьЛицевогоСчета.ФизЛицо = СтрокаСРаботником.ФизЛицо;
			ЗаписьЛицевогоСчета.НомерЛицевогоСчета = СтрокаСРаботником.НомерЛицевогоСчета;
			//vvv
			ЗаписьЛицевогоСчета.ДоговорБанка = ?(ЗначениеЗаполнено(СтрокаСРаботником.ДоговорБанка),СтрокаСРаботником.ДоговорБанка,ДоговорБанка);			
			ЗаписьЛицевогоСчета.Документ = Ссылка;			
			НаборЛицевыхСчетов.Записать();
			//
						
		КонецЦикла;
		
	Иначе
		
		Попытка
			ИсходноеДерево = ЗначениеИзСтрокиВнутр(ТекстПодтверждения);
		Исключение
			Возврат;
		КонецПопытки;
		
		Если ТипЗнч(ИсходноеДерево) <> Тип("ДеревоЗначений") Тогда
			Возврат;
		КонецЕсли;
		
		ПарсерПодтверждения = Обработки.ИмпортЭкспортОперацийПоЛицевымСчетамРаботников.Создать();
		
		МассивОпераций = ПарсерПодтверждения.ПолучитьОперации(ИсходноеДерево, "РезультатОткрытияСчетов");
		
		ЗаполненныеФизЛица = Новый Соответствие;
		
		Для каждого ОперацияПодтверждения из МассивОпераций Цикл
			
			ЗаписьЛицевогоСчета = ЗаполненныеФизЛица[ОперацияПодтверждения.Сотрудник];
			
			Если ЗаписьЛицевогоСчета = Неопределено Тогда
				ЗаписьЛицевогоСчета = НаборЛицевыхСчетов.Добавить();
				ЗаписьЛицевогоСчета.Организация = Организация;
				ЗаписьЛицевогоСчета.Банк = Банк;
				//vvv
				ЗаписьЛицевогоСчета.ДоговорБанка = ДоговорБанка;
				//
				ЗаписьЛицевогоСчета.ФизЛицо = ОперацияПодтверждения.Сотрудник;
				ЗаполненныеФизЛица.Вставить(ОперацияПодтверждения.Сотрудник, ЗаписьЛицевогоСчета);
			КонецЕсли;
			
			Если ВРЕГ(СтрЗаменить(ОперацияПодтверждения.Результат, " ", "")) = "СЧЕТОТКРЫТ" Тогда
				ЗаписьЛицевогоСчета.НомерЛицевогоСчета = ОперацияПодтверждения.ЛицевойСчет;
				
			Иначе
				ЗаполненныеФизЛица.Вставить(ОперацияПодтверждения.Сотрудник, Неопределено);
				НаборЛицевыхСчетов.Удалить(ЗаписьЛицевогоСчета);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//vvv комментируем
	//Для каждого ЗаписьВРегистр из НаборЛицевыхСчетов Цикл
	//	Сообщить("Записана информация о лицевом счете " + ЗаписьВРегистр.НомерЛицевогоСчета + " (работник " + ЗаписьВРегистр.ФизЛицо + " )");
	//КонецЦикла;
	//
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	НаборЛицевыхСчетов = РегистрыСведений.ЛицевыеСчетаРаботниковОрганизации.СоздатьНаборЗаписей();
	
	НаборЛицевыхСчетов.Отбор.Организация.Установить(мОрганизация);
	Если Не мБанк.Пустая() Тогда 
		НаборЛицевыхСчетов.Отбор.Банк.Установить(мБанк);
	КонецЕсли;
	НаборЛицевыхСчетов.Прочитать();
	НомерЗаписиНабора = НаборЛицевыхСчетов.Количество() - 1;
	Пока НомерЗаписиНабора >= 0 Цикл
		Если НаборЛицевыхСчетов[НомерЗаписиНабора].Документ = Ссылка Тогда
			НаборЛицевыхСчетов.Удалить(НомерЗаписиНабора);
		КонецЕсли;
		НомерЗаписиНабора = НомерЗаписиНабора - 1
	КонецЦикла;

	НаборЛицевыхСчетов.Записать();
	
	ТекстПодтверждения = "";
КонецПроцедуры
